---
kind: other
id: Methods.T:Autodesk.Revit.DB.Analysis.EnergyAnalysisMaterial
source: html/1f237f93-c29a-3070-9d3f-118843370a21.htm
---
# EnergyAnalysisMaterial Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.